open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_gateway.c
/****************************************************************************
 * app/bk7258/bk7258_voice_gateway.c
 *
 * SPDX-License-Identifier: Apache-2.0
 ****************************************************************************/

#include "bk7258_voice_gateway.h"

#include <errno.h>
#include <limits.h>
#include <string.h>

static bool bkvoice_gateway_downlink_ops_valid(
  const struct bkvoice_gateway_downlink_ops_s *ops)
{
  return ops != NULL && ops->tts_start != NULL && ops->tts_audio != NULL &&
         ops->tts_end != NULL && ops->terminal != NULL;
}

static uint32_t bkvoice_gateway_get_be32(const uint8_t *data)
{
  return ((uint32_t)data[0] << 24) | ((uint32_t)data[1] << 16) |
         ((uint32_t)data[2] << 8) | data[3];
}

static void bkvoice_gateway_put_be32(uint8_t *data, uint32_t value)
{
  data[0] = (uint8_t)(value >> 24);
  data[1] = (uint8_t)(value >> 16);
  data[2] = (uint8_t)(value >> 8);
  data[3] = (uint8_t)value;
}

static void bkvoice_gateway_put_be16(uint8_t *data, uint16_t value)
{
  data[0] = (uint8_t)(value >> 8);
  data[1] = (uint8_t)value;
}

static bool bkvoice_gateway_ota_phase_terminal(
  enum bkvoice_companion_ota_phase_e phase)
{
  return phase == BKVOICE_COMPANION_OTA_CONFIRMED ||
         phase == BKVOICE_COMPANION_OTA_ROLLED_BACK ||
         phase == BKVOICE_COMPANION_OTA_FAILED;
}

static bool bkvoice_gateway_ota_phase_valid(
  enum bkvoice_companion_ota_phase_e phase)
{
  return phase >= BKVOICE_COMPANION_OTA_DOWNLOADING &&
         phase <= BKVOICE_COMPANION_OTA_FAILED;
}

static bool bkvoice_gateway_ota_transition_valid(
  enum bkvoice_companion_ota_phase_e current, uint8_t current_progress,
  enum bkvoice_companion_ota_phase_e next, uint8_t next_progress)
{
  if (next == BKVOICE_COMPANION_OTA_FAILED)
    {
      return true;
    }

  if (next == current)
    {
      return next_progress >= current_progress;
    }

  switch (current)
    {
      case BKVOICE_COMPANION_OTA_DOWNLOADING:
        return next == BKVOICE_COMPANION_OTA_VERIFYING;
      case BKVOICE_COMPANION_OTA_VERIFYING:
        return next == BKVOICE_COMPANION_OTA_STAGED;
      case BKVOICE_COMPANION_OTA_STAGED:
        return next == BKVOICE_COMPANION_OTA_REBOOTING;
      case BKVOICE_COMPANION_OTA_REBOOTING:
        return next == BKVOICE_COMPANION_OTA_TRIAL;
      case BKVOICE_COMPANION_OTA_TRIAL:
        return next == BKVOICE_COMPANION_OTA_CONFIRMED ||
               next == BKVOICE_COMPANION_OTA_ROLLED_BACK;
      default:
        return false;
    }
}

static uint64_t bkvoice_gateway_deadline(struct bkvoice_gateway_s *gateway)
{
  uint64_t now = gateway->now_ms(gateway->clock_context);

  if (UINT64_MAX - now < gateway->config.io_timeout_ms)
    {
      return UINT64_MAX;
    }

  return now + gateway->config.io_timeout_ms;
}

static bool bkvoice_gateway_token_matches(
  const struct bkvoice_gateway_s *gateway,
  const struct bkvoice_turn_token_s *token, bool next_turn)
{
  uint32_t expected_turn;

  if (token == NULL || token->boot_generation !=
      gateway->companion.boot_generation ||
      token->session_id != gateway->companion.session_id)
    {
      return false;
    }

  expected_turn = gateway->companion.turn_id;
  if (next_turn)
    {
      if (expected_turn == UINT32_MAX)
        {
          return false;
        }

      expected_turn++;
    }

  return token->turn_id == expected_turn;
}

static int bkvoice_gateway_lock(struct bkvoice_gateway_s *gateway)
{
  int ret = pthread_mutex_lock(&gateway->lock);
  return ret == 0 ? 0 : -ret;
}

static int bkvoice_gateway_unlock(struct bkvoice_gateway_s *gateway)
{
  int ret = pthread_mutex_unlock(&gateway->lock);
  return ret == 0 ? 0 : -ret;
}

static int bkvoice_gateway_terminal_locked(
  struct bkvoice_gateway_s *gateway, int reason)
{
  if (gateway->companion.session_id == 0 ||
      gateway->companion.turn_id == 0 ||
      (gateway->companion.state != BKVOICE_COMPANION_UPLINK &&
       gateway->companion.state != BKVOICE_COMPANION_THINKING &&
       gateway->companion.state != BKVOICE_COMPANION_DOWNLINK))
    {
      return 0;
    }

  return gateway->downlink_ops.terminal(
    gateway->downlink_context, gateway->companion.session_id,
    gateway->companion.turn_id, reason);
}

static int bkvoice_gateway_fault_locked(struct bkvoice_gateway_s *gateway,
                                        int error, bool notify_terminal)
{
  if (error >= 0)
    {
      error = -EIO;
    }

  if (!gateway->faulted && notify_terminal)
    {
      (void)bkvoice_gateway_terminal_locked(gateway, error);
    }

  bkvoice_companion_session_disconnect(&gateway->companion);
  gateway->faulted = true;
  gateway->last_error = error;

  /* This is safe concurrently with send/recv and only wakes I/O.  The
   * serialized owner closes the provider after those callers join.
   */

  (void)bkvoice_transport_interrupt(&gateway->transport);
  return error;
}

static int bkvoice_gateway_send_locked(struct bkvoice_gateway_s *gateway,
                                       uint8_t type, uint16_t flags,
                                       const uint8_t *payload,
                                       uint32_t payload_len,
                                       uint64_t deadline_ms)
{
  struct bkvoice_companion_session_s candidate;
  struct bkvoice_companion_header_s header;
  size_t encoded_size;
  int ret;

  if (payload_len > BKVOICE_GATEWAY_MAX_PAYLOAD)
    {
      return -EMSGSIZE;
    }

  candidate = gateway->companion;
  ret = bkvoice_companion_session_tx(&candidate, type, flags, payload,
                                     payload_len,
                                     gateway->now_ms(gateway->clock_context),
                                     &header);
  if (ret < 0)
    {
      if (ret == -EOVERFLOW)
        {
          return bkvoice_gateway_fault_locked(gateway, ret, false);
        }

      return ret;
    }

  ret = bkvoice_companion_encode(&header, payload, gateway->tx_frame,
                                 sizeof(gateway->tx_frame), &encoded_size);
  if (ret < 0)
    {
      return bkvoice_gateway_fault_locked(gateway, ret, false);
    }

