open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_gateway.c
  ret = bkvoice_transport_send_all(&gateway->transport, gateway->tx_frame,
                                   encoded_size, deadline_ms);
  if (ret < 0)
    {
      return bkvoice_gateway_fault_locked(gateway, ret, false);
    }

  gateway->companion = candidate;
  gateway->tx_frames++;
  gateway->last_error = 0;
  return 0;
}

static int bkvoice_gateway_send_ota_report_locked(
  struct bkvoice_gateway_s *gateway, uint32_t request_sequence,
  const uint8_t manifest_sha256[BKVOICE_COMPANION_OTA_MANIFEST_SHA256_BYTES],
  int result, enum bkvoice_companion_ota_phase_e phase, uint8_t progress)
{
  uint8_t payload[BKVOICE_COMPANION_OTA_REPORT_BYTES];

  if (request_sequence == 0 || manifest_sha256 == NULL ||
      !bkvoice_gateway_ota_phase_valid(phase) || progress > 100u ||
      result > 0 ||
      ((phase == BKVOICE_COMPANION_OTA_FAILED) != (result < 0)))
    {
      return -EINVAL;
    }

  memset(payload, 0, sizeof(payload));
  bkvoice_gateway_put_be32(payload, request_sequence);
  bkvoice_gateway_put_be32(payload + 4, (uint32_t)result);
  payload[8] = (uint8_t)phase;
  payload[9] = progress;
  memcpy(payload + 12, manifest_sha256,
         BKVOICE_COMPANION_OTA_MANIFEST_SHA256_BYTES);
  return bkvoice_gateway_send_locked(gateway, BKVOICE_COMPANION_OTA_REPORT,
                                    0, payload, sizeof(payload),
                                    bkvoice_gateway_deadline(gateway));
}

static int bkvoice_gateway_report_ota_locked(
  struct bkvoice_gateway_s *gateway, uint32_t request_sequence,
  const uint8_t manifest_sha256[BKVOICE_COMPANION_OTA_MANIFEST_SHA256_BYTES],
  int result, enum bkvoice_companion_ota_phase_e phase, uint8_t progress)
{
  bool terminal;
  int ret;

  if (!gateway->ota_active || request_sequence == 0 ||
      request_sequence != gateway->ota_request_sequence ||
      manifest_sha256 == NULL ||
      memcmp(manifest_sha256, gateway->ota_manifest_sha256,
             sizeof(gateway->ota_manifest_sha256)) != 0 ||
      !bkvoice_gateway_ota_transition_valid(gateway->ota_phase,
                                             gateway->ota_progress,
                                             phase, progress))
    {
      return -EINVAL;
    }

  ret = bkvoice_gateway_send_ota_report_locked(gateway, request_sequence,
                                                manifest_sha256, result,
                                                phase, progress);
  if (ret < 0)
    {
      return ret;
    }

  terminal = bkvoice_gateway_ota_phase_terminal(phase);
  if (terminal)
    {
      gateway->ota_active = false;
      gateway->ota_request_sequence = 0;
      gateway->ota_phase = 0;
      gateway->ota_progress = 0;
      memset(gateway->ota_manifest_sha256, 0,
             sizeof(gateway->ota_manifest_sha256));
    }
  else
    {
      gateway->ota_phase = (uint8_t)phase;
      gateway->ota_progress = progress;
    }

  return 0;
}

static int bkvoice_gateway_grant_downlink_locked(
  struct bkvoice_gateway_s *gateway, uint32_t bytes)
{
  uint8_t payload[sizeof(uint32_t)];

  bkvoice_gateway_put_be32(payload, bytes);
  return bkvoice_gateway_send_locked(
    gateway, BKVOICE_COMPANION_WINDOW_UPDATE, 0, payload,
    sizeof(payload), bkvoice_gateway_deadline(gateway));
}

static int bkvoice_gateway_dispatch_locked(
  struct bkvoice_gateway_s *gateway,
  const struct bkvoice_companion_header_s *header,
  const uint8_t *payload)
{
  struct bkvoice_companion_session_s candidate;
  struct bkvoice_turn_token_s token;
  uint8_t volume_report[12];
  unsigned int observed = UINT32_MAX;
  uint64_t now_ms;
  int ret;

  candidate = gateway->companion;
  ret = bkvoice_companion_session_rx(&candidate, header, payload);
  if (ret < 0)
    {
      return bkvoice_gateway_fault_locked(gateway, ret, true);
    }

  memset(&token, 0, sizeof(token));
  switch (header->type)
    {
      case BKVOICE_COMPANION_OTA_REQUEST:
        if (gateway->ota_active || candidate.state != BKVOICE_COMPANION_IDLE)
          {
            gateway->companion = candidate;
            gateway->rx_frames++;
            ret = bkvoice_gateway_send_ota_report_locked(
              gateway, header->sequence, payload, -EBUSY,
              BKVOICE_COMPANION_OTA_FAILED, 0);
            return ret < 0 ? ret : -EBUSY;
          }

        if (gateway->config.ota_request == NULL)
          {
            return -ENOTSUP;
          }

        /* The adapter only admits work.  It runs under the gateway lock so
         * it must return promptly and must not re-enter any gateway API.
         * The first report is emitted here, before later owner updates. */

        ret = gateway->config.ota_request(
          gateway->config.ota_context, header->sequence, payload);
        if (ret > 0)
          {
            ret = -EIO;
          }

        gateway->companion = candidate;
        gateway->rx_frames++;
        gateway->ota_active = true;
        gateway->ota_request_sequence = header->sequence;
        gateway->ota_phase = BKVOICE_COMPANION_OTA_DOWNLOADING;
        gateway->ota_progress = 0;
        memcpy(gateway->ota_manifest_sha256, payload,
               sizeof(gateway->ota_manifest_sha256));
        return bkvoice_gateway_report_ota_locked(
          gateway, header->sequence, payload, ret,
          ret < 0 ? BKVOICE_COMPANION_OTA_FAILED :
                    BKVOICE_COMPANION_OTA_DOWNLOADING,
          0);

      case BKVOICE_COMPANION_VOLUME_GET:
      case BKVOICE_COMPANION_VOLUME_SET:
        ret = gateway->downlink_ops.volume == NULL ? -ENOTSUP :
          gateway->downlink_ops.volume(gateway->downlink_context,
            header->type == BKVOICE_COMPANION_VOLUME_SET,
            header->payload_len ? bkvoice_gateway_get_be32(payload) : 0,
            &observed);
        if (ret > 0 || (ret == 0 && observed > 100u))
          {
            ret = -EIO;
          }

        bkvoice_gateway_put_be32(volume_report, header->sequence);
        bkvoice_gateway_put_be32(volume_report + 4, (uint32_t)ret);
        bkvoice_gateway_put_be32(volume_report + 8,
                                  ret < 0 ? UINT32_MAX : observed);
        gateway->companion = candidate;
        gateway->rx_frames++;
        return bkvoice_gateway_send_locked(gateway,
          BKVOICE_COMPANION_VOLUME_REPORT, 0, volume_report,
          sizeof(volume_report), bkvoice_gateway_deadline(gateway));

      case BKVOICE_COMPANION_TTS_START:
      case BKVOICE_COMPANION_AUDIO_DOWN:
      case BKVOICE_COMPANION_TTS_END:
        if (gateway->downlink_sequence == UINT32_MAX)
          {
            return bkvoice_gateway_fault_locked(gateway, -EOVERFLOW, true);
          }

