open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_gateway.c
        token.boot_generation = header->boot_generation;
        token.session_id = header->session_id;
        token.turn_id = header->turn_id;
        token.sequence = gateway->downlink_sequence + 1u;
        now_ms = gateway->now_ms(gateway->clock_context);

        if (header->type == BKVOICE_COMPANION_TTS_START)
          {
            ret = gateway->downlink_ops.tts_start(
              gateway->downlink_context, &token, now_ms);
          }
        else if (header->type == BKVOICE_COMPANION_AUDIO_DOWN)
          {
            ret = gateway->downlink_ops.tts_audio(
              gateway->downlink_context, &token, payload,
              header->payload_len, now_ms);
          }
        else
          {
            ret = gateway->downlink_ops.tts_end(
              gateway->downlink_context, &token);
          }

        if (ret < 0)
          {
            return bkvoice_gateway_fault_locked(gateway, ret, true);
          }

        gateway->downlink_sequence = token.sequence;
        if (header->type == BKVOICE_COMPANION_AUDIO_DOWN)
          {
            /* rx() consumed this frame's advertised window and tts_audio()
             * has now handed the complete frame to the local playback queue.
             * Commit that receive before returning the same credit.  Calling
             * the public helper here would re-enter the gateway mutex.
             */

            gateway->companion = candidate;
            gateway->rx_frames++;
            return bkvoice_gateway_grant_downlink_locked(
              gateway, header->payload_len);
          }

        break;

      case BKVOICE_COMPANION_CANCEL:
        ret = gateway->downlink_ops.terminal(
          gateway->downlink_context, header->session_id, header->turn_id,
          -ECANCELED);
        if (ret < 0)
          {
            return bkvoice_gateway_fault_locked(gateway, ret, false);
          }
        break;

      case BKVOICE_COMPANION_ERROR:
        ret = bkvoice_gateway_terminal_locked(gateway, -EREMOTEIO);
        if (ret < 0)
          {
            return bkvoice_gateway_fault_locked(gateway, ret, false);
          }

        return bkvoice_gateway_fault_locked(gateway, -EREMOTEIO, false);

      default:
        break;
    }

  gateway->companion = candidate;
  gateway->rx_frames++;
  gateway->last_error = 0;
  return 0;
}

static int bkvoice_gateway_sink_start(
  void *context, const struct bkvoice_turn_token_s *token)
{
  struct bkvoice_gateway_s *gateway = context;
  int ret;

  if (gateway == NULL || !gateway->initialized)
    {
      return -EINVAL;
    }

  ret = bkvoice_gateway_lock(gateway);
  if (ret < 0)
    {
      return ret;
    }

  if (gateway->faulted)
    {
      ret = -ENOTCONN;
    }
  else if (gateway->ota_active)
    {
      ret = -EBUSY;
    }
  else if (!bkvoice_gateway_token_matches(gateway, token, true))
    {
      ret = -ESTALE;
    }
  else
    {
      ret = bkvoice_gateway_send_locked(
        gateway, BKVOICE_COMPANION_TURN_START, 0, NULL, 0,
        bkvoice_gateway_deadline(gateway));
    }

  (void)bkvoice_gateway_unlock(gateway);
  return ret;
}

static int bkvoice_gateway_sink_audio(
  void *context, const struct bkvoice_turn_token_s *token,
  const uint8_t *pcm, size_t bytes)
{
  struct bkvoice_gateway_s *gateway = context;
  int ret;

  if (gateway == NULL || !gateway->initialized || pcm == NULL)
    {
      return -EINVAL;
    }

  if (bytes != BKVOICE_COMPANION_AUDIO_FRAME_BYTES)
    {
      return -EMSGSIZE;
    }

  ret = bkvoice_gateway_lock(gateway);
  if (ret < 0)
    {
      return ret;
    }

  if (gateway->faulted)
    {
      ret = -ENOTCONN;
    }
  else if (!bkvoice_gateway_token_matches(gateway, token, false))
    {
      ret = -ESTALE;
    }
  else
    {
      ret = bkvoice_gateway_send_locked(
        gateway, BKVOICE_COMPANION_AUDIO_UP, 0, pcm, (uint32_t)bytes,
        bkvoice_gateway_deadline(gateway));
    }

  (void)bkvoice_gateway_unlock(gateway);
  return ret;
}

static int bkvoice_gateway_sink_end(
  void *context, const struct bkvoice_turn_token_s *token)
{
  struct bkvoice_gateway_s *gateway = context;
  int ret;

  if (gateway == NULL || !gateway->initialized)
    {
      return -EINVAL;
    }

  ret = bkvoice_gateway_lock(gateway);
  if (ret < 0)
    {
      return ret;
    }

  if (gateway->faulted)
    {
      ret = -ENOTCONN;
    }
  else if (!bkvoice_gateway_token_matches(gateway, token, false))
    {
      ret = -ESTALE;
    }
  else
    {
      ret = bkvoice_gateway_send_locked(
        gateway, BKVOICE_COMPANION_TURN_END, 0, NULL, 0,
        bkvoice_gateway_deadline(gateway));
    }

  (void)bkvoice_gateway_unlock(gateway);
  return ret;
}

int bkvoice_gateway_ack_stopped(struct bkvoice_gateway_s *gateway,
                               uint32_t session_id, uint32_t turn_id)
{
  int ret;

  if (gateway == NULL || !gateway->initialized)
    {
      return -EINVAL;
    }

  ret = bkvoice_gateway_lock(gateway);
  if (ret < 0)
    {
      return ret;
    }

  if (gateway->faulted ||
      gateway->companion.state != BKVOICE_COMPANION_IDLE ||
      session_id != gateway->companion.session_id || turn_id == 0 ||
      turn_id != gateway->companion.turn_id)
    {
      ret = -ESTALE;
    }
  else
    {
      ret = bkvoice_gateway_send_locked(gateway, BKVOICE_COMPANION_ACK,
                                        0, NULL, 0,
                                        bkvoice_gateway_deadline(gateway));
    }

  (void)bkvoice_gateway_unlock(gateway);
  return ret;
}

int bkvoice_gateway_report_status(
  struct bkvoice_gateway_s *gateway,
  const struct bkvoice_gateway_status_s *status)
{
  uint8_t payload[BKVOICE_COMPANION_STATUS_REPORT_V2_BYTES];
  size_t payload_size;
  int ret;

  if (gateway == NULL || !gateway->initialized || status == NULL)
    {
      return -EINVAL;
    }

  memset(payload, 0, sizeof(payload));
  payload_size = status->firmware_identity_valid ?
                 BKVOICE_COMPANION_STATUS_REPORT_V2_BYTES :
                 BKVOICE_COMPANION_STATUS_REPORT_BYTES;
  payload[0] = status->firmware_identity_valid ? 2 : 1;
  payload[1] = status->battery_percent;
  payload[2] = status->charging;
  payload[3] = status->battery_state;
  bkvoice_gateway_put_be32(payload + 4, status->battery_voltage_mv);
  bkvoice_gateway_put_be16(payload + 8, status->firmware_major);
  bkvoice_gateway_put_be16(payload + 10, status->firmware_minor);
  bkvoice_gateway_put_be16(payload + 12, status->firmware_revision);
  bkvoice_gateway_put_be32(payload + 16, status->firmware_build);
  if (status->firmware_identity_valid)
    {
      memcpy(payload + BKVOICE_COMPANION_STATUS_REPORT_BYTES,
             status->firmware_root_sha256,
             BKVOICE_COMPANION_FIRMWARE_ROOT_BYTES);
    }

  ret = bkvoice_gateway_lock(gateway);
  if (ret < 0)
    {
      return ret;
    }

  if (gateway->faulted)
    {
      ret = -ENOTCONN;
    }
  else if (gateway->companion.state != BKVOICE_COMPANION_IDLE)
    {
      ret = -EBUSY;
    }
  else
    {
      ret = bkvoice_gateway_send_locked(
        gateway, BKVOICE_COMPANION_STATUS_REPORT, 0, payload,
        payload_size, bkvoice_gateway_deadline(gateway));
    }

  (void)bkvoice_gateway_unlock(gateway);
  return ret;
}

int bkvoice_gateway_report_ota(
  struct bkvoice_gateway_s *gateway, uint32_t request_sequence,
  const uint8_t manifest_sha256[BKVOICE_COMPANION_OTA_MANIFEST_SHA256_BYTES],
  int result, enum bkvoice_companion_ota_phase_e phase,
  uint8_t progress)
{
  int ret;

  if (gateway == NULL || !gateway->initialized || manifest_sha256 == NULL)
    {
      return -EINVAL;
    }

  ret = bkvoice_gateway_lock(gateway);
  if (ret < 0)
    {
      return ret;
    }

  if (gateway->faulted || gateway->companion.state !=
      BKVOICE_COMPANION_IDLE)
    {
      ret = -ENOTCONN;
    }
  else
    {
      ret = bkvoice_gateway_report_ota_locked(gateway, request_sequence,
                                               manifest_sha256, result,
                                               phase, progress);
    }

  (void)bkvoice_gateway_unlock(gateway);
  return ret;
}

static int bkvoice_gateway_sink_cancel(
  void *context, const struct bkvoice_turn_token_s *token, int reason)
{
  struct bkvoice_gateway_s *gateway = context;
  int ret;

  (void)reason;
  if (gateway == NULL || !gateway->initialized)
    {
      return -EINVAL;
    }

  ret = bkvoice_gateway_lock(gateway);
  if (ret < 0)
    {
      return ret;
    }

  if (gateway->faulted ||
      gateway->companion.state == BKVOICE_COMPANION_DISCONNECTED)
    {
      ret = 0;
    }
  else if (gateway->companion.state != BKVOICE_COMPANION_UPLINK &&
           gateway->companion.state != BKVOICE_COMPANION_THINKING &&
           gateway->companion.state != BKVOICE_COMPANION_DOWNLINK)
    {
      ret = 0;
    }
  else if (!bkvoice_gateway_token_matches(gateway, token, false))
    {
      ret = -ESTALE;
    }
  else
    {
      ret = bkvoice_gateway_send_locked(
        gateway, BKVOICE_COMPANION_CANCEL, 0, NULL, 0,
        bkvoice_gateway_deadline(gateway));
    }

  (void)bkvoice_gateway_unlock(gateway);
  return ret;
}

static const struct bkvoice_capture_sink_ops_s g_bkvoice_gateway_sink_ops =
{
  .start = bkvoice_gateway_sink_start,
  .audio = bkvoice_gateway_sink_audio,
  .end = bkvoice_gateway_sink_end,
  .cancel = bkvoice_gateway_sink_cancel,
};

