open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_gateway.c
int bkvoice_gateway_initialize(
  struct bkvoice_gateway_s *gateway,
  const struct bkvoice_transport_ops_s *transport_ops,
  void *transport_context,
  const struct bkvoice_gateway_downlink_ops_s *downlink_ops,
  void *downlink_context,
  bkvoice_gateway_now_ms_t now_ms, void *clock_context,
  const struct bkvoice_gateway_config_s *config,
  uint32_t boot_generation)
{
  int ret;

  if (gateway == NULL || downlink_context == NULL || now_ms == NULL ||
      config == NULL || config->io_timeout_ms == 0 ||
      !bkvoice_gateway_downlink_ops_valid(downlink_ops))
    {
      return -EINVAL;
    }

  memset(gateway, 0, sizeof(*gateway));
  ret = bkvoice_transport_initialize(&gateway->transport, transport_ops,
                                     transport_context);
  if (ret < 0)
    {
      return ret;
    }

  ret = bkvoice_companion_session_init(&gateway->companion,
                                       boot_generation);
  if (ret < 0)
    {
      return ret;
    }

  ret = pthread_mutex_init(&gateway->lock, NULL);
  if (ret != 0)
    {
      return -ret;
    }

  memcpy(&gateway->downlink_ops, downlink_ops, sizeof(*downlink_ops));
  memcpy(&gateway->config, config, sizeof(*config));
  gateway->downlink_context = downlink_context;
  gateway->clock_context = clock_context;
  gateway->now_ms = now_ms;
  gateway->initialized = true;
  return 0;
}

int bkvoice_gateway_uninitialize(struct bkvoice_gateway_s *gateway)
{
  struct bkvoice_transport_snapshot_s transport;
  int ret;

  if (gateway == NULL || !gateway->initialized)
    {
      return -EINVAL;
    }

  ret = bkvoice_gateway_lock(gateway);
  if (ret < 0)
    {
      return ret;
    }

  bkvoice_transport_snapshot(&gateway->transport, &transport);
  if (transport.opened || gateway->companion.state !=
      BKVOICE_COMPANION_DISCONNECTED)
    {
      (void)bkvoice_gateway_unlock(gateway);
      return -EBUSY;
    }

  gateway->initialized = false;
  (void)bkvoice_gateway_unlock(gateway);
  ret = pthread_mutex_destroy(&gateway->lock);
  if (ret != 0)
    {
      gateway->initialized = true;
      return -ret;
    }

  memset(gateway, 0, sizeof(*gateway));
  return 0;
}

int bkvoice_gateway_connect(struct bkvoice_gateway_s *gateway,
                            uint64_t deadline_ms)
{
  uint8_t capabilities[4];
  uint32_t capability_mask;
  int close_ret;
  int ret;

  if (gateway == NULL || !gateway->initialized)
    {
      return -EINVAL;
    }

  ret = bkvoice_gateway_lock(gateway);
  if (ret < 0)
    {
      return ret;
    }

  if (gateway->faulted)
    {
      ret = -EIO;
      goto out;
    }

  if (gateway->connection_generation == UINT32_MAX)
    {
      ret = -EOVERFLOW;
      goto out;
    }

  ret = bkvoice_transport_open(&gateway->transport, deadline_ms);
  if (ret < 0)
    {
      gateway->last_error = ret;
      goto out;
    }

  gateway->connection_generation++;
  ret = bkvoice_companion_session_connect(&gateway->companion);
  if (ret < 0)
    {
      gateway->last_error = ret;
      close_ret = bkvoice_transport_close(&gateway->transport);
      if (close_ret < 0)
        {
          gateway->faulted = true;
        }

      goto out;
    }

  gateway->downlink_sequence = 0;
  gateway->tx_frames = 0;
  gateway->rx_frames = 0;
  capability_mask = BKVOICE_COMPANION_CAP_PLAYBACK_ACK |
                    BKVOICE_COMPANION_CAP_STATUS_REPORT;
  if (gateway->downlink_ops.volume != NULL)
    {
      capability_mask |= BKVOICE_COMPANION_CAP_VOLUME;
    }

  if (gateway->config.ota_request != NULL)
    {
      capability_mask |= BKVOICE_COMPANION_CAP_OTA;
    }

  bkvoice_gateway_put_be32(capabilities, capability_mask);
  ret = bkvoice_gateway_send_locked(gateway, BKVOICE_COMPANION_HELLO, 0,
                                    capabilities, sizeof(capabilities),
                                    deadline_ms);
  if (ret < 0)
    {
      /* No receive worker exists before HELLO succeeds, so this close cannot
       * race I/O.  A close failure remains retryable through disconnect().
       */

      close_ret = bkvoice_transport_close(&gateway->transport);
      if (close_ret >= 0)
        {
          bkvoice_companion_session_disconnect(&gateway->companion);
        }
    }

out:
  (void)bkvoice_gateway_unlock(gateway);
  return ret;
}

int bkvoice_gateway_interrupt(struct bkvoice_gateway_s *gateway)
{
  if (gateway == NULL || !gateway->initialized)
    {
      return -EINVAL;
    }

  return bkvoice_transport_interrupt(&gateway->transport);
}

int bkvoice_gateway_disconnect(struct bkvoice_gateway_s *gateway,
                               int reason)
{
  int ret;

  if (gateway == NULL || !gateway->initialized)
    {
      return -EINVAL;
    }

  if (reason >= 0)
    {
      reason = -ENOTCONN;
    }

  ret = bkvoice_gateway_lock(gateway);
  if (ret < 0)
    {
      return ret;
    }

  if (!gateway->faulted)
    {
      (void)bkvoice_gateway_terminal_locked(gateway, reason);
    }

  ret = bkvoice_transport_close(&gateway->transport);
  if (ret < 0)
    {
      gateway->faulted = true;
      gateway->last_error = ret;
      (void)bkvoice_gateway_unlock(gateway);
      return ret;
    }

  bkvoice_companion_session_disconnect(&gateway->companion);
  gateway->downlink_sequence = 0;
  gateway->ota_active = false;
  gateway->ota_request_sequence = 0;
  gateway->ota_phase = 0;
  gateway->ota_progress = 0;
  memset(gateway->ota_manifest_sha256, 0,
         sizeof(gateway->ota_manifest_sha256));
  gateway->faulted = false;
  gateway->last_error = reason;
  (void)bkvoice_gateway_unlock(gateway);
  return 0;
}

int bkvoice_gateway_receive_frame(struct bkvoice_gateway_s *gateway,
                                  struct bkvoice_gateway_frame_s *frame,
                                  uint64_t deadline_ms)
{
  uint32_t payload_len;
  int ret;

  if (frame == NULL)
    {
      return -EINVAL;
    }

  memset(frame, 0, sizeof(*frame));
  if (gateway == NULL || !gateway->initialized)
    {
      frame->error = -EINVAL;
      return frame->error;
    }

  ret = bkvoice_gateway_lock(gateway);
  if (ret < 0)
    {
      frame->error = ret;
      return ret;
    }

  frame->generation = gateway->connection_generation;
  ret = gateway->faulted || gateway->companion.state ==
        BKVOICE_COMPANION_DISCONNECTED ? -ENOTCONN : 0;
  (void)bkvoice_gateway_unlock(gateway);
  if (ret < 0)
    {
      frame->error = ret;
      return ret;
    }

