open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_gateway.c
  ret = bkvoice_transport_recv_exact(&gateway->transport, frame->data,
                                     BKVOICE_COMPANION_HEADER_BYTES,
                                     deadline_ms);
  if (ret < 0)
    {
      frame->error = ret;
      return ret;
    }

  payload_len = bkvoice_gateway_get_be32(frame->data + 12);
  if (payload_len > BKVOICE_GATEWAY_MAX_PAYLOAD)
    {
      frame->error = -EMSGSIZE;
      return frame->error;
    }

  ret = bkvoice_transport_recv_exact(
    &gateway->transport, frame->data + BKVOICE_COMPANION_HEADER_BYTES,
    payload_len, deadline_ms);
  if (ret < 0)
    {
      frame->error = ret;
      return ret;
    }

  frame->size = BKVOICE_COMPANION_HEADER_BYTES + payload_len;
  return 0;
}

int bkvoice_gateway_dispatch_frame(
  struct bkvoice_gateway_s *gateway,
  const struct bkvoice_gateway_frame_s *frame)
{
  struct bkvoice_companion_header_s header;
  const uint8_t *payload;
  int ret;

  if (gateway == NULL || !gateway->initialized || frame == NULL)
    {
      return -EINVAL;
    }

  ret = bkvoice_gateway_lock(gateway);
  if (ret < 0)
    {
      return ret;
    }

  /* Check generation before inspecting errors or payload.  A queued frame
   * from the previous connection has no authority over this connection.
   */

  if (frame->generation == 0 ||
      frame->generation != gateway->connection_generation)
    {
      ret = -ESTALE;
      goto out;
    }

  if (gateway->faulted || gateway->companion.state ==
      BKVOICE_COMPANION_DISCONNECTED)
    {
      ret = -ENOTCONN;
      goto out;
    }

  if (frame->error != 0)
    {
      ret = bkvoice_gateway_fault_locked(gateway, frame->error, true);
      goto out;
    }

  if (frame->size < BKVOICE_COMPANION_HEADER_BYTES ||
      frame->size > sizeof(frame->data))
    {
      ret = bkvoice_gateway_fault_locked(gateway, -EMSGSIZE, true);
      goto out;
    }

  ret = bkvoice_companion_decode(frame->data, frame->size, &header, &payload);
  if (ret < 0)
    {
      ret = bkvoice_gateway_fault_locked(gateway, ret, true);
    }
  else
    {
      ret = bkvoice_gateway_dispatch_locked(gateway, &header, payload);
    }

out:
  (void)bkvoice_gateway_unlock(gateway);
  return ret;
}

int bkvoice_gateway_receive_one(struct bkvoice_gateway_s *gateway,
                                uint64_t deadline_ms)
{
  struct bkvoice_gateway_frame_s frame;
  int ret;

  ret = bkvoice_gateway_receive_frame(gateway, &frame, deadline_ms);
  if (frame.generation == 0)
    {
      return ret;
    }

  return bkvoice_gateway_dispatch_frame(gateway, &frame);
}

int bkvoice_gateway_grant_downlink(struct bkvoice_gateway_s *gateway,
                                   uint32_t bytes)
{
  int ret;

  if (gateway == NULL || !gateway->initialized || bytes == 0 ||
      bytes > BKVOICE_COMPANION_MAX_WINDOW)
    {
      return -EINVAL;
    }

  ret = bkvoice_gateway_lock(gateway);
  if (ret < 0)
    {
      return ret;
    }

  if (gateway->faulted)
    {
      ret = -ENOTCONN;
    }
  else
    {
      ret = bkvoice_gateway_grant_downlink_locked(gateway, bytes);
    }

  (void)bkvoice_gateway_unlock(gateway);
  return ret;
}

const struct bkvoice_capture_sink_ops_s *bkvoice_gateway_capture_sink_ops(void)
{
  return &g_bkvoice_gateway_sink_ops;
}

void bkvoice_gateway_snapshot(struct bkvoice_gateway_s *gateway,
                              struct bkvoice_gateway_snapshot_s *snapshot)
{
  if (gateway == NULL || snapshot == NULL || !gateway->initialized)
    {
      return;
    }

  if (bkvoice_gateway_lock(gateway) < 0)
    {
      return;
    }

  memset(snapshot, 0, sizeof(*snapshot));
  bkvoice_transport_snapshot(&gateway->transport, &snapshot->transport);
  snapshot->companion_state = gateway->companion.state;
  snapshot->boot_generation = gateway->companion.boot_generation;
  snapshot->session_id = gateway->companion.session_id;
  snapshot->turn_id = gateway->companion.turn_id;
  snapshot->tx_sequence = gateway->companion.tx_sequence;
  snapshot->rx_sequence = gateway->companion.rx_sequence;
  snapshot->tx_window = gateway->companion.tx_window;
  snapshot->rx_window = gateway->companion.rx_window;
  snapshot->connection_generation = gateway->connection_generation;
  snapshot->downlink_sequence = gateway->downlink_sequence;
  snapshot->tx_frames = gateway->tx_frames;
  snapshot->rx_frames = gateway->rx_frames;
  snapshot->ota_request_sequence = gateway->ota_request_sequence;
  snapshot->ota_phase = gateway->ota_phase;
  snapshot->ota_progress = gateway->ota_progress;
  snapshot->ota_active = gateway->ota_active;
  snapshot->last_error = gateway->last_error;
  snapshot->initialized = gateway->initialized;
  snapshot->faulted = gateway->faulted;
  (void)bkvoice_gateway_unlock(gateway);
}
